# Запросы на выборку, соединение таблиц

In [ ]:
%load_ext sql
%sql mysql://root:adminadmin@localhost:3306/stepik?charset=utf8

In [ ]:
%%sql
--
SELECT
    version();

In [ ]:
%%sql 
--
DROP TABLE IF EXISTS book_22;
DROP TABLE IF EXISTS supply_22;
DROP TABLE IF EXISTS author_22;
DROP TABLE IF EXISTS genre_22;
DROP TABLE IF EXISTS city_22;

--  author
CREATE TABLE author_22 (
    author_id INT PRIMARY KEY AUTO_INCREMENT,
    name_author VARCHAR(50)
);

INSERT INTO
    author_22 (name_author)
VALUES
    ('Булгаков М.А.'),
    ('Достоевский Ф.М.'),
    ('Есенин С.А.'),
    ('Пастернак Б.Л.');

-- city
CREATE TABLE city_22 (
    city_id INT PRIMARY KEY AUTO_INCREMENT,
    name_city VARCHAR(50)
);

INSERT INTO
    city_22 (name_city)
VALUES
    ('Москва'),
    ('Санкт-Петербург'),
    ('Владивосток');

-- genre
CREATE TABLE genre_22 (
    genre_id INT PRIMARY KEY AUTO_INCREMENT,
    name_genre VARCHAR(30)
);

INSERT INTO
    genre_22 (name_genre)
VALUES
    ('Роман'),
    ('Поэзия'),
    ('Приключения');

-- book
CREATE TABLE book_22 (
    book_id INT PRIMARY KEY AUTO_INCREMENT,
    title VARCHAR(50),
    author_id INT,
    genre_id INT,
    price DECIMAL(8, 2),
    amount INT,
    FOREIGN KEY (author_id) REFERENCES author_22 (author_id) ON DELETE CASCADE,
    FOREIGN KEY (genre_id) REFERENCES genre_22 (genre_id) ON DELETE
    SET
        NULL
);

INSERT INTO
    book_22 (title, author_id, genre_id, price, amount)
VALUES
    ('Мастер и Маргарита', 1, 1, 670.99, 3),
    ('Белая гвардия', 1, 1, 540.50, 5),
    ('Идиот', 2, 1, 460.00, 10),
    ('Братья Карамазовы', 2, 1, 799.01, 3),
    ('Игрок', 2, 1, 480.50, 10),
    ('Стихотворения и поэмы', 3, 2, 650.00, 15),
    ('Черный человек', 3, 2, 570.20, 6),
    ('Лирика', 4, 2, 518.99, 2);

-- supply
CREATE TABLE supply_22 (
    supply_id INT PRIMARY KEY AUTO_INCREMENT,
    title VARCHAR(50),
    author VARCHAR(50),
    price DECIMAL(8, 2),
    amount INT
);

INSERT INTO
    supply_22 (title, author, price, amount)
VALUES
    ('Доктор Живаго', 'Пастернак Б.Л.', 618.99, 3),
    ('Черный человек', 'Есенин С.А.', 570.20, 6),
    ('Евгений Онегин', 'Пушкин А.С.', 440.80, 5),
    ('Идиот', 'Достоевский Ф.М.', 360.80, 3);

In [ ]:
%%sql 
-- Вывести название, жанр и цену тех книг, 
-- количество которых больше 8, 
-- в отсортированном по убыванию цены виде.
SELECT
    title,
    name_genre,
    price
FROM
    book_22
    JOIN genre_22 USING(genre_id)
WHERE
    amount > 8
ORDER BY
    price DESC;

In [ ]:
%%sql 
-- Вывести все жанры, которые не представлены в книгах на складе.
SELECT
    name_genre
FROM
    genre_22
    LEFT JOIN book_22 USING(genre_id)
WHERE book_id IS NULL;

In [ ]:
%%sql 
-- Необходимо в каждом городе провести выставку книг каждого автора в течение 2020 года. 
-- Дату проведения выставки выбрать случайным образом. 
-- Создать запрос, который выведет город, автора и дату проведения выставки.
--  Последний столбец назвать Дата. 
-- Информацию вывести, отсортировав сначала в алфавитном порядке по названиям городов,
--  а потом по убыванию дат проведения выставок.
SELECT
    name_city,
    name_author,
    (DATE_ADD('2020-01-01', INTERVAL FLOOR(RAND() * 365) DAY)) as Дата
FROM
    author_22 CROSS JOIN city_22
ORDER BY name_city, Дата DESC;

In [ ]:
%%sql 
-- Вывести информацию о книгах (жанр, книга, автор), 
-- относящихся к жанру, включающему слово «роман» 
-- в отсортированном по названиям книг виде.
SELECT
    name_genre, title, name_author
FROM
    book_22
    LEFT JOIN genre_22 USING(genre_id)
    JOIN author_22 USING(author_id)
WHERE
    name_genre LIKE '%роман%'
ORDER BY title
-- more performant
SELECT
    name_genre,
    title,
    name_author
FROM
    (
        SELECT
            *
        FROM
            genre_22
        WHERE
            name_genre LIKE '%роман%'
    ) as genre
    JOIN book_22 USING(genre_id)
    JOIN author_22 USING(author_id)
ORDER BY
    title

In [ ]:
%%sql 
-- Посчитать количество экземпляров  книг каждого автора из таблицы author. 
-- Вывести тех авторов,  количество книг которых меньше 10, 
-- в отсортированном по возрастанию количества виде. 
-- Последний столбец назвать Количество.

DELETE FROM
    author_22
WHERE name_author = 'Лермонтов М.Ю.';

INSERT INTO
    author_22 (name_author)
VALUES
    ('Лермонтов М.Ю.');

SELECT
    name_author,
    SUM(amount) as Количество
FROM
    author_22
    LEFT JOIN book_22 USING(author_id)
GROUP BY
    author_id
HAVING
    Количество < 10 OR Количество IS NULL
ORDER BY Количество;

In [ ]:
%%sql 
-- Вывести в алфавитном порядке всех авторов, которые пишут только в одном жанре. 
-- Поскольку у нас в таблицах так занесены данные, что у каждого автора книги только в одном жанре, 
-- для этого запроса внесем изменения в таблицу book. 
-- Пусть у нас  книга Есенина «Черный человек» относится к жанру «Роман»,
-- а книга Булгакова «Белая гвардия» к «Приключениям» (эти изменения в таблицы уже внесены).
UPDATE
    book_22
SET
    genre_id = IF(
        title = 'Белая гвардия',
        3,
        IF(title = 'Черный человек', 1, genre_id)
    );

SELECT
    *
FROM
    book_22;

SELECT
    name_author
FROM
    author_22
    JOIN (
        SELECT
            author_id,
            COUNT(DISTINCT genre_id) AS count_genre
        FROM
            book_22
        GROUP BY
            author_id
        HAVING
            count_genre = 1
    ) as single_genre_author USING(author_id)

In [ ]:
%%sql 
INSERT INTO
    book_22 (title, author_id, genre_id, price, amount)
VALUES
    ('Герой нашего времени', 5, 3, 570.59, 2),
    ('Доктор Живаго', 3, 3, 740.50, 5);

UPDATE
    book_22
SET
    amount = IF(
        book_id = 8,
        10,
        amount
    );

In [ ]:
%%sql 
-- Вывести информацию о книгах 
-- (название книги, фамилию и инициалы автора, название жанра, цену и количество экземпляров книги),
-- написанных в самых популярных жанрах, в отсортированном в алфавитном порядке по названию книг виде. 
-- Самым популярным считать жанр, общее количество экземпляров книг которого на складе максимально.
SELECT
    genre_id,
    SUM(amount)
FROM
    book_22
GROUP BY
    genre_id;

SELECT
    grouped_genres.genre_id
FROM
    (
        SELECT
            genre_id,
            SUM(amount) AS sum_amount
        FROM
            book_22
        GROUP BY
            genre_id
    ) AS grouped_genres
    JOIN (
        -- джоиним по максимуму
        SELECT
            -- выбираем максимум
            genre_id,
            SUM(amount) AS sum_amount
        FROM
            book_22
        GROUP BY
            genre_id
        ORDER BY
            sum_amount DESC
        LIMIT
            1
    ) AS max_genre USING(sum_amount);

SELECT
    title, name_author, name_genre, price, amount
FROM
    book_22
    JOIN author_22 USING(author_id)
    JOIN genre_22 USING(genre_id)
WHERE
    book_22.genre_id IN (
        SELECT
            grouped_genres.genre_id
        FROM
            (
                SELECT
                    genre_id,
                    SUM(amount) AS sum_amount
                FROM
                    book_22 as b
                GROUP BY
                    genre_id
            ) AS grouped_genres
            JOIN (
                -- джоиним по максимуму
                SELECT
                    -- выбираем максимум
                    genre_id,
                    SUM(amount) AS sum_amount
                FROM
                    book_22
                GROUP BY
                    genre_id
                ORDER BY
                    sum_amount DESC
                LIMIT
                    1
            ) AS max_genre USING(sum_amount)
    )
ORDER BY title

In [ ]:
%%sql 
-- Если в таблицах supply  и book есть одинаковые книги, которые имеют равную цену,  
-- вывести их название и автора, а также посчитать общее количество экземпляров книг в таблицах supply и book, 
-- столбцы назвать Название, Автор  и Количество.
SELECT
    b.title AS Название,
    a.name_author AS Автор,
    (s.amount + b.amount) AS Количество
FROM
    book_22 AS b
    JOIN author_22 AS a USING (author_id)
    JOIN supply_22 AS s ON b.title = s.title
                        AND a.name_author = s.author
                        AND b.price = s.price